In [1]:
import numpy as np
import pandas as pd

In [3]:
data2 = np.arange(1,24,2).reshape(3,4)
data2

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [8]:
df=pd.DataFrame(data2, columns=["col1","col2","col3","col4"],index=["a","b","c"])
df

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [10]:
len(df)

3

In [11]:
df.col1

a     1
b     9
c    17
Name: col1, dtype: int32

In [12]:
df.keys

<bound method NDFrame.keys of    col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23>

In [14]:
df["col1"]

a     1
b     9
c    17
Name: col1, dtype: int32

                                                              creating data frame

In [15]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)

In [16]:
myDict= {"var1" : s1, "var2" : s2, "var3" : s3}
myDict

{'var1': array([4, 6, 8, 6, 6, 5, 3, 5, 9, 3, 8, 7, 2, 7, 9, 9, 6, 3, 4, 3, 3, 5,
        4, 8, 7, 5, 8, 4, 8, 3, 8, 3, 4, 4, 6, 4, 4, 5, 2, 4]),
 'var2': array([98, 72, 37, 59, 60, 89, 68, 95, 33, 58, 34, 40, 52, 51, 85, 86, 74,
        39, 36, 91, 99, 44, 99, 46, 35, 45, 46, 92, 99, 73, 59, 91, 40, 46,
        78, 80, 67, 67, 39, 61]),
 'var3': array([127, 137, 103, 110, 132, 120, 106, 142, 103, 124, 106, 141, 120,
        134, 137, 114, 102, 126, 111, 135, 147, 102, 143, 109, 104, 113,
        111, 103, 143, 117, 140, 127, 143, 115, 125, 102, 112, 107, 143,
        110])}

In [18]:
df_dict = pd.DataFrame(myDict)
df_dict

    var1  var2  var3
0      4    98   127
1      6    72   137
2      8    37   103
3      6    59   110
4      6    60   132
5      5    89   120
6      3    68   106
7      5    95   142
8      9    33   103
9      3    58   124
10     8    34   106
11     7    40   141
12     2    52   120
13     7    51   134
14     9    85   137
15     9    86   114
16     6    74   102
17     3    39   126
18     4    36   111
19     3    91   135
20     3    99   147
21     5    44   102
22     4    99   143
23     8    46   109
24     7    35   104
25     5    45   113
26     8    46   111
27     4    92   103
28     8    99   143
29     3    73   117
30     8    59   140
31     3    91   127
32     4    40   143
33     4    46   115
34     6    78   125
35     4    80   102
36     4    67   112
37     5    67   107
38     2    39   143
39     4    61   110

In [19]:
df_dict[3:5]

   var1  var2  var3
3     6    59   110
4     6    60   132

In [20]:
df_dict2 = df_dict[3:5]
df_dict2

   var1  var2  var3
3     6    59   110
4     6    60   132

In [22]:
df_dict2.index = ["a","b"]           #index manipulasyon yaptik
df_dict2

   var1  var2  var3
a     6    59   110
b     6    60   132

In [25]:
df_dict2.columns = ["X","Y","Z"]
df_dict2

   X   Y    Z
a  6  59  110
b  6  60  132

In [27]:
#ikisini ayni kodda da yapabiliriz
pd.DataFrame(df_dict2.values, index=["c","d"],columns=["5","6","7"])  #df_dict2 nin yanina .values yazmaz isen degerleri gostermiyor.Nol veriyor...

   5   6    7
c  6  59  110
d  6  60  132

INDEXING SLICING AND SELECTION METHODS AND SEVRAL ETTRIBUTES USING DIFFRENT DataFrame

In [28]:
np.random.seed(101)
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [30]:
np.random.seed(101)
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split()) #split deafult olarak bosluk ile ayirir ve degerleri listeye koyar
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [38]:
df3[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [39]:
df3.loc[:,"W":"Y"]  #location ile cagiriyoruz

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [40]:
df3.loc["B":"D","W":"Y"]

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237

In [41]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df3["X"]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
df3["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [46]:
df3["X"] * df3["Y"]

A    0.570325
B    0.270806
C    0.391387
D    0.708208
E    5.156577
dtype: float64

In [47]:
df3["X"] + df3["Y"]**2

A    1.452541
B    0.399917
C    1.019766
D    0.112060
E    8.769823
dtype: float64

In [49]:
#YENI COLUMN EKLEME
df3["Result"] = df3["W"]*df3["X"] + df3["Y"]**2 - df3["Z"]
df3

          W         X         Y         Z    Result
A  2.706850  0.628133  0.907969  0.503826  2.020844
B  0.651118 -0.319318 -0.848077  0.605965 -0.094644
C -2.018168  0.740122  0.528813 -0.589001 -0.625047
D  0.188695 -0.758872 -0.933237  0.955057 -0.227320
E  0.190794  1.978757  2.605967  0.683509  6.485092

In [57]:
df3["Result"] = df3["W"]*df3["X"] + df3["Y"].std() - df3["Z"].mean()
df3

          W         X         Y         Z    Result
A  2.706850  0.628133  0.907969  0.503826  2.722906
B  0.651118 -0.319318 -0.848077  0.605965  0.814731
C -2.018168  0.740122  0.528813 -0.589001 -0.471046
D  0.188695 -0.758872 -0.933237  0.955057  0.879449
E  0.190794  1.978757  2.605967  0.683509  1.400180

In [51]:
df3["Result"] = df3["W"]*df3["X"] + df3["Y"].std() - df3["Z"].mean() +100
df3

          W         X         Y         Z      Result
A  2.706850  0.628133  0.907969  0.503826  102.722906
B  0.651118 -0.319318 -0.848077  0.605965  100.814731
C -2.018168  0.740122  0.528813 -0.589001   99.528954
D  0.188695 -0.758872 -0.933237  0.955057  100.879449
E  0.190794  1.978757  2.605967  0.683509  101.400180

In [52]:
df3.drop("Result",axis=1) #Kalici silmez

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df3

          W         X         Y         Z      Result
A  2.706850  0.628133  0.907969  0.503826  102.722906
B  0.651118 -0.319318 -0.848077  0.605965  100.814731
C -2.018168  0.740122  0.528813 -0.589001   99.528954
D  0.188695 -0.758872 -0.933237  0.955057  100.879449
E  0.190794  1.978757  2.605967  0.683509  101.400180

In [55]:
#df3.drop("Result",axis=1      #inplace=True yazarsak kalici olarak siler       ) 
df3 = df3.drop("Result",axis=1) #2 inci bir yontem de budur

In [56]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
m=np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [61]:
df4.loc[2]

var1    13
var2    18
var3    12
var4    16
Name: 2, dtype: int32

In [62]:
df4.loc[2:6]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23

In [63]:
df4.index='a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [65]:
df4.loc["c"]

var1    13
var2    18
var3    12
var4    16
Name: c, dtype: int32

In [66]:
df4.loc["c":"f"]

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23

In [68]:
df4.loc["c":"f","var1":"var3"]

   var1  var2  var3
c    13    18    12
d    34    30    25
e    20    36    31
f    21    28     9

In [70]:
df4.iloc[:]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [71]:
df4.iloc[1:4,2:4]

   var3  var4
b    16     1
c    12    16
d    25    37

In [72]:
df4.iloc[:,2:4]

   var3  var4
a    39    10
b    16     1
c    12    16
d    25    37
e    31    11
f     9    23
g    38    23
h    19    29

                                                                            Conditional Statement

In [73]:
df3["X"]>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [77]:
df3[df3["X"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [78]:
df3[(df3["X"] > 0) & (df3["Z"]>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df3[(df3.X > 0) & (df3.Z>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509